{
    "TenD":[
    {
        "album": "Tenacious D",
        "shortname": "Tenacious_D",
        "year": "2001-2003",
        "information": "In May 2000, Tenacious D signed to Epic Records.[36] As Black's profile increased due to his roles in films such as High Fidelity the band worked on recording their first album with producers the Dust Brothers.[3] In 2001, they released their debut Tenacious D. It peaked at #33 on the Billboard 200 on October 13, 2001.[43][44] While Tenacious D usually appears as a duo, the album was backed by a full band, consisting of Dave Grohl on drums and guitar, keyboardist Page McConnell of Phish, guitarist Warren Fitzgerald of The Vandals, and bassist Steven Shane McDonald of Redd Kross.[45] According to Black, they chose to use a band because 'no one's ever heard us with a band' .[45] The majority of songs on the album were performed previously on their short-lived television series. Although the critical reaction varied, by November 2005, the album had achieved platinum status in the US.[47] Entertainment Weekly described the release as 'hilarious', and 'no mere comedy record'.[48] AllMusic wrote that the album 'rocks so damn hard', but lamented the absence of some of the songs from the television show.[49] Flak Magazine criticised the band's use of skits between songs, describing them as 'distracting' and a 'nuisance'.[50] In addition, The Independent remarked that the album was full of 'swearing and scatology' and was 'bereft of even the slightest skidmark of humour'. The first single from the album was 'Tribute': a tribute to the 'greatest song in the world' which, in the song, Tenacious D claimed they had performed in order to save their souls from a demon.[52] A music video, directed by Liam Lynch, was shot for the song.[53] The video achieved success and was voted the fifth best music video ever by Kerrang! readers.[54] This was followed by the second single, 'Wonderboy', the music video of which was directed by Spike Jonze.[55] A third video, an animation depicting Black and Gass as cherubs, was made for 'Fuck Her Gently', directed by Ren and Stimpy-creator John Kricfalusi. The album also included 'Dio', a song written as a tribute to rock singer Ronnie James Dio, which mocked him somewhat for being too old.[56] Dio liked the song enough to ask the band to appear in the music video for his song, 'Push'.[57] An EP entitled D Fun Pak was released in 2002. It featured a skit and acoustic versions of 'Jesus Ranch' and 'Kyle Quit The Band', as well as a megamix by Mocean Worker. The Complete Masterworks, a music DVD featuring the entire run of their TV series, music videos, and a live performance from London's Brixton Academy recorded in 2002, was released on November 9, 2003.",
        "tracks": ["Kielbasa", "One Note Song", "Tribute", "Wonderboy", "Hard Fucking", "Fuck Her Gently", "Explosivo", "Dio", "Inward Singing", "Kyle Quit The Band", "The Road", "Cock Pushups", "Lee", "Friendship test", "Friendship", "Karate Schnitzel", "Karate", "Rock Your Socks", "Drive-Thru", "Double Team", "City Hall/I Believe/Malibu Nights Medley"]

    },
    {
        "album": "The Pick of Destiny",
        "shortname": "The_Pick_of_Destiny",
        "year": "2003-2008",
        "information": "On November 7, 2000, Tenacious D had just finished writing the rough first script for a movie. This script was later scrapped for a plot line about the two searching for a sacred guitar pick.[59] In October 2003 Black announced that the screenplay for The Pick of Destiny—a fictional portrayal of the band's formation—had been completed.[60] Again working with director Liam Lynch,[61] the film was initially to be written and developed by Working Title Films, but Black and Gass decided to assume creative control when they were not satisfied with the writers' ideas.[28][62] Filming had been expected to take place by the end of 2003;[63] however, it was delayed by almost a year due to Black being cast in Peter Jackson's big budget remake of King Kong.[64] The band started recording songs for the soundtrack of the film, their second studio album, The Pick of Destiny. This album's recording featured John Konesky on electric guitar and John Spiker on bass—two musicians Gass had met in Ohio when forming his side-project band, Trainwreck.[65] Dave Grohl again played drums, and further lent vocals to 'Beelzeboss (The Final Showdown)' as well as acting in the film, as Satan. 'A lot of enthusiastic stoners were like, Yeah, duuude! Just saw it! I was like, Where were you when the movie came out? Sorry, dude, I was hi-i-i-gh!' — Jack Black on The Pick of Destiny's disappointing box-office performance.[66] To coincide with the release of their new film and album, Tenacious D embarked on their 2006–07 tour of the US, Canada, UK, Australia, and New Zealand. This tour included the band's first appearance at New York City's Madison Square Garden. Unlike other tours, this one featured a full backing band.[80] Konesky and Spiker resumed their roles from the album, and Brooks Wackerman was added as drummer.[81] Each member used a pseudonym; Konesky as the Antichrist, Spiker as Charlie Chaplin, and Wackerman as Colonel Sanders.[82] JR Reed also toured as Satan.[82] Black has said that the band lost money on the tour due to the cost of touring with a full band for the first time.[",
        "tracks": ["Kickapoo", "Classico", "Baby", "Destiny", "History", "The Government Totally Sucks", "Master Exploder", "The Divide", "Papagenu (He's My Sassafrass)", "Dude (I Totally Miss You)", "Break In-City (Storm the Gate!)", "Car Chase City", "Beelzeboss", "POD", "The Metal"]
    },
    {
        "album": "Rize of the Fenix",
        "shortname": "Rize_of_the_Fenix",
        "year": "2008-2015",
        "information": "Rize of the Fenix is the third studio album by American rock band Tenacious D. Produced by John Kimbrough, it was released in North America on May 15, 2012 by Columbia Records.",
        "tracks": ["Rize of the Fenix", "Low Hangin Fruit", "Classical Teacher", "Senorita", "Deth Starr", "Roadie", "Flutes & Trombones", "The Ballad of Hollywood JAck and the Rage Kage", "Throw Down", "Rock is Dead", "They Fucked Our Asses", "To Be the Best", "39"]
    },
    {
        "album": "Post Apocalypto",
        "shortname": "Post_Apocalypto",
        "year": "2012-",
        "information": "Tenacious D, the rock duo comprised of Jack Black and Kyle Gass, released their album Post-Apocalypto, as well as the final episode in their animated series of the same name, on Friday (Nov. 2). Accompanying the album is a six-part video series featured on Tenacious D’s YouTube page. Hand-drawn by Black himself, the explicit series follows the hilarious antics of two friends, voiced by Black and Gass, after the world is destroyed by an atomic bomb. Tenacious D have been releasing the series in chapters each Friday since September, marking the release of their Post-Apocalypto album with the sixth and final episode. The new album brings listeners on a sonic journey through the series and features Foo Fighters frontman Dave Grohl on drums. Post-Apocalypto is the duo’s fourth LP and first release since 2012’s Rize of the Fenix. ",
        "tracks": ["Post-Apocalypto Theme", "Desolation", "Hope", "Cave Women", "Making Love", "Scientists", "Take Us Into Space", "I've Got to Go", "Fuck Yo-Yo Ma", "Reunion/Not So Fast", "Daddy Ding Dong", "Chainsaw Bazooka Machine Gun", "Robot", "March", "Turd Whistle", "Colors", "Who's Your Daddy", "JB Jr Rap", "Woman Time", "Save the World", "Post-Apocalypto Theme (Reprise)"]
    }]
}